brew "neovim"
brew "git"
brew "coreutils"
brew "gnu-sed"
brew "stow"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "node"                       # nvim-treesitter / some LSPs need it (Ubuntu README installs node)
brew "tree-sitter"

cask "alacritty"
cask "aerospace"
cask "firefox"
cask "slack"
cask "proton-pass"
cask "sioyek"
cask "mactex"                     # ~5GB; needs sudo/GUI; this is the slow one
cask "font-jetbrains-mono-nerd-font"   # matches alacritty.toml (NOT font-hack)
# Optional (uncomment if wanted): cask "maccy"  (clipboard history)
# No karabiner: custom .keylayout + native Caps->Esc cover it.
